{
  "name": "Bhagath Gajbinkar",
  "summary": "A results-driven DevOps Manager with 8+ years of experience in automation, CI/CD, cloud-native deployments, and infrastructure management. Skilled in leading teams, optimizing workflows, and implementing best practices for software delivery.",
  "education": "Bachelor of Science in Computer Science from Bhavan’s Vivekananda College (2013–2016).",
  "work-experience": [
    {
      "role": "DevOps Manager │ Cognizant │ India",
      "duration": "Apr 2022 – Present",
      "details": [
        "Managed the automation of CI/CD pipelines using GitHub Actions for TIBCO BusinessWorks (TCI) and Flogo applications, accelerating delivery cycles.",
        "Administered 550+ GitHub repositories, ensuring optimized access control, branch protection, and automated workflows.",
        "Administered MuleSoft Anypoint Platform, focusing on business group setups and user access management for seamless integrations.",
        "Led the adoption of containerization technologies such as Docker and Kubernetes, enhancing application deployment flexibility.",
        "Collaborated with clients and internal teams to assess and modernize cloud infrastructure, recommending and implementing best practices."
      ]
    },
    {
      "role": "Middleware & DevOps Administrator │ Deloitte │ India",
      "duration": "Sep 2016 – Mar 2022",
      "details": [
        "Managed IBM WebSphere environments, ensuring optimized application setup, performance tuning, and deployment.",
        "Developed and maintained CI/CD pipelines using Bamboo, facilitating automated application deployment across different environments.",
        "Automated system administration tasks and workflow processes using Shell scripting and cron jobs, enhancing operational efficiency.",
        "Integrated observability tools like Zabbix into CI/CD workflows for real-time system monitoring and performance analysis.",
        "Coordinated release activities, including troubleshooting and post-release triaging, to ensure smooth deployments.",
        "Managed version control using Git and SVN, ensuring effective synchronization of development and deployment tasks."
      ]
    }
  ],
  "skills": [
    "GitHub & GitHub Actions",
    "Azure DevOps",
    "Kubernetes & OpenShift",
    "Docker & Containerization",
    "Terraform & Infrastructure as Code",
    "Shell Scripting & Automation",
    "CI/CD Pipeline Design",
    "Monitoring & Logging (Prometheus, ELK Stack)",
    "Cloud Platforms: AWS, Azure",
    "Disaster Recovery & Security Compliance"
  ],
  "certifications": [
    "GitHub Certified",
    "Azure DevOps Engineer Expert",
    "Kubernetes Administrator (CKA) - in progress"
  ],
  "achievements": [
    "Successfully led a team to migrate legacy applications to cloud-native architecture, reducing deployment time by 60%.",
    "Automated multi-environment CI/CD pipelines for enterprise clients, improving release reliability and speed.",
    "Designed and implemented robust monitoring and alerting solutions across DevOps workflows.",
    "Mentored junior DevOps engineers, improving team efficiency and knowledge sharing."
  ],
  "personal_projects": [
    "Developed an AI-based chatbot for internal knowledge sharing using OpenAI API.",
    "Automated daily operational scripts, saving 10+ hours per week for the team."
  ],
  "interests": [
    "Exploring cloud technologies and new automation tools",
    "Contributing to open-source DevOps projects",
    "Tech blogging and knowledge sharing"
  ]
}
